// Задача 26: Напишите программу, которая принимает на вход число и выдаёт количество цифр в числе.
// 456 -> 3
// 78 -> 2
// 89126 -> 5
Console.Clear();
Console.Write("Введите число: ");
string cc = Console.ReadLine();
int Countnumbers(string count)
{
    int a = cc.Length;
    return (int)cc.Length;
}
Console.Write($"{cc} -> {Countnumbers(cc)}");